Feature: Add Files



       Scenario: Εισαγωγή εγγράφου στο προφίλ του χρήστη
             Given ότι ο χρήστης είναι εγγεγραμμένος στην υπηρεσία.
             Given ότι ο χρήστης υποβάλλει ένα νέο έγγραφο στο προφίλ του.
			           |όνομα_εγγράφου|τύπος αρχείου|
             Then ο χρήστης πρέπει να δει το προφίλ του με το νέο έγγραφο.
             And θα έχει την δυνατότητα να δει το σύνολο των εγγράφων που έχει εισάγει.
	     
	Scenario: Εισαγωγή εγγράφου που είναι μεγαλύτερου μεγέθους από αυτό που μπορεί να σηκώσει το σύστημα
             Givenότι ο χρήστης είναι εγγεγραμμένος στην υπηρεσία.
	     When ο χρήστης θέλει να υποβάλλει ένα νέο έγγραφο στο στο προφίλ του
			           |όνομα_εγγράφου|τύπος αρχείου|
             Then θα εμφανίζεται στην οθόνη ένα μήνυμα σφάλματος που θα λέει "Παρακαλώ ανεβάστε ένα αρχείο μικρότερου μεγέθους".
	     And θα τον παρακινεί να ανεβάσει το αρχείο.
		
		
			   
