Feature: add files

     # Post /Files
	   # GET, PUT, DELETE/ Files/{FilesID}



      Υπόβαθρο: 
           Δεδομένου ότι ο χρήστης είναι εγγεγραμμένος στην υπηρεσία.

			   
       Σενάριο: Εισαγωγή εγγράφου στο προφίλ του χρήστη
           Όταν ο χρήστης υποβάλλει ένα νέο έγγραφο στο προφίλ του.
			           |όνομα_εγγράφου|τύπος αρχείου|
           Τότε ο χρήστης πρέπει να δει το προφίλ του με το νέο έγγραφο.
			     Και  θα έχει την δυνατότητα να δει το σύνολο των εγγράφων που έχει εισάγει.
			 
		
		
		Σενάριο: Εισαγωγή εγγράφου που είναι μεγαλύτερου μεγέθους από αυτό που μπορεί να σηκώσει το σύστημα
		    Όταν ο χρήστης θέλει να υποβάλλει ένα νέο έγγραφο στο στο προφίλ του
			           |όνομα_εγγράφου|τύπος αρχείου|
			  Τότε θα εμφανίζεται στην οθόνη ένα μήνυμα σφάλματος που θα λέει "Παρακαλώ ανεβάστε ένα αρχείο μικρότερου μεγέθους".
			  Και θα τον παρακινεί να ανεβάσει το αρχείο.
		
		
			   
