Feature : AdministrationView

        
		
		Σενάριο: Προβολή του συνόλου των αιτήσεων.
		    Δεδομένου του ότι έχουν υποβληθεί αιτήσεις.
			  Όταν η ομάδα των διαχειριστών πραγματοποιεί ελέγχους
			  Τότε θα μπορεί να πραγματοποιεί επεμβάσεις στις αιτήσεις.
			   
			   
		Σενάριο: Διαγραφή μίας αίτησης απασχόλησης ενός εργαζομένου.
		    Δεδομένου ότι η ομάδα διαχειριστών εντόπισε μία αίτηση απασχόλησης η οποία πρέπει να διαγραφεί.
				Όταν η ομάδα διαχειριστών επιλέξει την διαγραφή της άιτησης απασχόλησης
				Τότε εμφανίζεται ένα μήνυμα στην οθόνη που λέει "Επιτυχής διαγραφή της αίτησης απασχόλησης."
			   
			   
		Σενάριο: Προσπάθεια προβολής του συνόλου των αιτήσεων.
        Δεδομένου ότι κάποιο μέλος της ομάδας διαχειριστών προσπαθεί να προβάλει τις υποβληθέντες αιτήσεις, ενώ αυτές δεν υπάρχουν.
        Όταν η ομάδα διαχειριστών πραγματοποιεί ελέγχους.
        Τότε θα εμφανίζεται στην οθόνη μήνυμα σφάλματος που θα λέει "Σφάλμα δεν υπάρχει καμία αίτηση στο σύστημα.".
				
				
