Feature : All applications Employer




     Υπόβαθρο: 
		      Δεδομένου του ότι ο χρήστης έχει εγγραφεί στην  υπηρεσία.
			  
			  
	   Σενάριο: Προβολή των αιτήσεων που έγιναν στο παρελθόν
		     Δεδομένου ότι ο υποψήφιος εργαζόμενος έχει αποστείλει αιτήσεις.
			   Τότε θα μπορεί να τις προβάλει.
			           |όνομα_εργασίας|ΕργασίαId|Όνομα_εγγράφου|
			   Και να προβάλλεται το σύνολο των αιτήσεων που έχει κάνει.
			   Και να προβάλεται η κατάσταση της αίτησης του.
			   
			   
			   
	   Σενάριο: Προσπάθεια προβολής όλων των υποβληθέντων αιτήσεων από υποψήφιο εργαζόμενο ο οποίος δεν έχει υποβάλει αιτήσεις
		          σε κάποιο φορέα απασχόλησης μέσω του συστήματος.
		     Δεδομένου ότι ένας εργαζόμενος δεν έχει υποβάλει αίτηση απασχόλησης.
         Τότε θα εμφανίζεται στην οθόνη του μήνυμα σφάλματος το οποίο θα λέει "Σφάλμα δεν έχετε υποβάλλει αιτήσεις μέχρι τώρα".
         Και θα τον παρακινεί να αναζητήσει για κάποια εργασία η οποία θα τον ενδιαφέρει.			   
		       
		
		Σενάριο: Προσπάθεια προβολής της κατάστασης μίας αίτησης του για θέση εργασίας η οποία καλήφθεικε.
		    Δεδομένου ότι ένας υποψήφιος εργαζόμενος έχει αποστείλει αιτήσεις στο παρελθόν.
				Όταν θα κοιτά την κατάσταση μίας αίτησης για μία θέση εργασίας η οποία όμως καλύφθηκε.
				Τότε θα εμφανίζεται στην οθόνη μήνυμα σφάλματος το οποίο θα λέει "Λυπούμαστε αυτή η θέση καλύφθηκε."
				Και το σύστημα θα τον παρακινεί να αναζητήσει κάποια άλλη θέση εργασίας.
