Feature : All applications Employee




      Υπόβαθρο: 
		       Δεδομένου του ότι ο χρήστης έχει εγγραφεί στην  υπηρεσία.
			  
			  
	    Σενάριο: Προβολή των αιτήσεων που έγιναν στο παρελθόν
		      Δεδομένου ότι ο φορέας απασχόλησης έχει δεχθεί αιτήσεις απασχόλησης.
			    Τότε θα μπορεί να τις προβάλει.
			           |όνομα_εργασίας|ΕργασίαId|Όνομα_εγγράφου|
			    Και να προβάλλεται το σύνολο των αιτήσεων που έχει κάνει.
			    Και να προβάλεται η κατάσταση της αίτησης του.
			   
			   
		Σενάριο: Προβολή όλων των αιτήσεων που έχουν υποβληθεί σε έναν φορέα απασχόλησης ο οποίος δεν έχει δεχθεί αιτήσεις μέχρι τώρα.
		    Όταν ο φορέας απασχόλης ο οποίος δεν έχει δεχθεί αιτήσεις προσπαθεί να βρει τις αιτήσεις που του έχουν υποβληθεί.
				Τότε εμφανίζεται στην οθόνη του μήνυμα σφάλματος το οποίο λέει "Σφάλμα δεν έχετε δεχθεί κάποια αίτηση απασχόλησης μέχρι τώρα.".
				Και παρακινεί τον φορέα να ψάξει ανάμεσα στπυς υποψήφιους εργαζόμενους για κάποιον ο οποίος ταιριάζει στην θέση απασχόλησης που παρέχει.
		
		
		Σενάριο: Ο όγκος των αιτήσεων που έχει δεχθεί ένας φορέας απασχόλησης είναι πολύ μεγάλος.
		    Όταν ένας φορέας ο οποίος έχει δεχθεί πολύ μεγάλο αριθμό αιτήσεων προσπαθεί να δεί, το 
        σύνολο των αιτήσεων απασχόλησης που έχει δεχθεί.
        Τότε εμφανίζεται στην οθόνη του προειδοποιητικό μήνυμα "Προσοχή ο όγκος των αιτήσεων που σας έχουν υποβληθεί είναι πολύ μεγάλος 
				παρακαλώ διαγράψτε μερικές από τις αιτήσεις που σας έχουν υποβληθεί.".				 
