Feature: AllApplicationsEmployer


						  
     Scenario: Προβολή των αιτήσεων που έγιναν στο παρελθόν
	 Given ότι ο υποψήφιος εργαζόμενος έχει αποστείλει αιτήσεις.
	 Given ότι ο χρήστης έχει εγγραφεί στην  υπηρεσία.
	 Then θα μπορεί να τις προβάλει.
	       |όνομα_εργασίας|ΕργασίαId|Όνομα_εγγράφου|
	 And να προβάλλεται το σύνολο των αιτήσεων που έχει κάνει.
	 And να προβάλεται η κατάσταση της αίτησης του.
			   
			   
			   
     Scenario: Προσπάθεια προβολής όλων των υποβληθέντων αιτήσεων από υποψήφιο εργαζόμενο ο οποίος δεν έχει υποβάλει αιτήσεις σε κάποιο φορέα απασχόλησης μέσω του συστήματος.
         Given ότι ένας εργαζόμενος δεν έχει υποβάλει αίτηση απασχόλησης.
         Then θα εμφανίζεται στην οθόνη του μήνυμα σφάλματος το οποίο θα λέει "Σφάλμα δεν έχετε υποβάλλει αιτήσεις μέχρι τώρα".
         And θα τον παρακινεί να αναζητήσει για κάποια εργασία η οποία θα τον ενδιαφέρει.			   
		       
		
      Scenario: Προσπάθεια προβολής της κατάστασης μίας αίτησης του για θέση εργασίας η οποία καλήφθεικε.
          Given ότι ένας υποψήφιος εργαζόμενος έχει αποστείλει αιτήσεις στο παρελθόν.
	  When θα κοιτά την κατάσταση μίας αίτησης για μία θέση εργασίας η οποία όμως καλύφθηκε.
	  Then θα εμφανίζεται στην οθόνη μήνυμα σφάλματος το οποίο θα λέει "Λυπούμαστε αυτή η θέση καλύφθηκε."
	  And το σύστημα θα τον παρακινεί να αναζητήσει κάποια άλλη θέση εργασίας.
