Feature: Κατηγορία

	Scenario: πρόσθεση κατηγορίας
		Με την προυπόθεση ότι είμαι διαχειριστής
		Όταν θέλω να προσθέσω μια κατηγορία
		Και προσθέσω περιεχόμενο 
		Τότε πρέπει να είμαι σε θέση να δω τη νέα κατηγορία

	Scenario: Αφαίρεση κατηγορίας
		Δεδομένου ότι η κατηγορία υπάρχει 
		Όταν εκτελέσω διαγραφή της κατηγορίας
		Τότε θα βλέπω ένα μήνυμα που θα λέει "Η κατηγορία διεγράφη"
		
	Scenario: Ενημέρωση κατηγορίας
		Δεδομένου ότι η κατηγορία υπάρχει 
		Όταν μεταβάλω το περιεχόμενο της κατηγορίας
		Τότε θα βλέπω ένα μήνυμα "Η κατηγορία ενημερώθηκε"
