Feature: Καλυμένη θέση εργασίας

	Scenario: Απαγόρευση δήλωσης ενδιαφέροντος
		Έχοντας δικαώματα χρήσης ως Φορέας απασχόλησης
		Όταν έχω καλύψει τις κενές θέσεις που προσφέρω 
		Τότε δεν θα προβάλλεται η επιλογή "Δήλωση ενδιαφέροντος" στην δημοσίευση
		Και θα ενημερώνω τους υποψήφιους με τη σημείωση "Η θέση δεν είναι πλέον διαθέσιμη" 

	Scenario: Διαγραφή δημοσιευμένης καλυμενης θέσης
		Έχοντας δικαώματα διαχειριστή
		Όταν βλέπω ότι η περίοδος υποβολής αιτήσεων έληξε  
		Τότε θα έχω τη δυνατότητα να διαγράψω την ανάρτηση
