Feature: ClosedWorkPosition

	Scenario: Απαγόρευση δήλωσης ενδιαφέροντος
		Given ότι έχω δικαώματα χρήσης ως Φορέας απασχόλησης
		When έχω καλύψει τις κενές θέσεις που προσφέρω 
		Then δεν θα προβάλλεται η επιλογή "Δήλωση ενδιαφέροντος" στην δημοσίευση
		And θα ενημερώνω τους υποψήφιους με τη σημείωση "Η θέση δεν είναι πλέον διαθέσιμη" 

	Scenario: Διαγραφή δημοσιευμένης καλυμενης θέσης
		Given ότι έχω δικαώματα διαχειριστή
		When βλέπω ότι η περίοδος υποβολής αιτήσεων έληξε  
		Then θα έχω τη δυνατότητα να διαγράψω την ανάρτηση
