Feature: EmployerTag


Scenario: Προσθήκη ετικέτας
	 Given ότι ο φορέας έχει διαθέσιμες θέσεις εργασίας.
         Given ότι ο φορέας έχει εγγραφεί στην  υπηρεσία.
         Then προσθέτει κάποιες ετικέτες οι οποίες περιγράφουν το επάγγελμα.
	 Then εμφανίζει μήνυμα στην οθόνη που λέει "Ο τίτλος της θέσης εργασίας καταχωρίθηκε.".
			   
			   
Scenario: Προσθήκη ετικέτας η οποία δεν έχει αναφερθεί χρησιμοποιηθεί ξανά στο παρελθόν.
         Given ότι ο εργοδότης προσπαθεί να καταχωρίσει μία ετικέτα η οποία δεν έχει χρησιμοποιηθεί στο παρελθόν.
         When επιλέγει εισαγωγή ετικέτας.
	 Then εμφανίζεται στην οθόνη του χρήστη ένα μήνυμα σφάλματος που λέεί "Προσοχή δεν έχει χρησιμοποιηθεί ξανά αυτό το επάγγελμα.".
         And παρακινεί τον χρήστη να προσθέσει το επάγγελμα στο σύστημα.
				 
                   		
