Feature : Employer tag

        
    Υπόβαθρο: 
		     Δεδομένου του ότι ο ενδιαφερόμενος για τη θέση εργασίας έχει εγγραφεί στην  υπηρεσία.
		
		
		Σενάριο: Προσθήκη ετικέτας
		     Δεδομένου του ότι ο ενδιαφερόμενος για τη θέση εργασίας έχει διαθέσιμες θέσεις εργασίας.
			   Τότε έχει τη δυνατότητα να προσθέσει ετικέτες στις παρεχόμενες θέσεις εργασίας.
			   Και εμφανίζει μήνυμα στην οθόνη που λέει "Ο τίτλος της θέσης εργασίας καταχωρίθηκε.".
			   
			   
	  Σενάριο: Προσθήκη ετικέτας η οποία δεν έχει αναφερθεί χρησιμοποιηθεί ξανά στο παρελθόν.
		     Δεδομένου του ότι ο ενδιαφερόμενος για την θέση προσπαθεί να καταχωρίσει μία ετικέτα η οποία δεν έχει χρησιμοποιηθεί στο παρελθόν.
				 Όταν επιλέγει εισαγωγή ετικέτας.
				 Τότε εμφανίζεται στην οθόνη του χρήστη ένα μήνυμα σφάλματος που λέεί "Προσοχή δεν έχει χρησιμοποιηθεί ξανά αυτό το επάγγελμα.".7
				 Και παρακινεί τον χρήστη να προσθέσει το επάγγελμα στο σύστημα.
				 
                   		
