Feature: Jobs Update

   # Post /Jobs
   # GET, PUT, DELETE/ Jobs/{JobsID}
		  
   Σενάριο : προβολή των πιο πρόσφατων θέσεων εργασίας 
	Δεδομένου ότι ο υποψηφιος εργαζόμενος είναι ήδη εγγεγραμμένος στην υπηρεσία.
        Όταν θα επισκέπτεται την κεντρική οθόνη της υπηρεσίας.
        Τότε θα ενημερώνεται σχετικά με τις πιο πρόσφατες θέσεις εργασίας οι οποίες έχουν δημοσιευθει.
		   
     Σενάριο : Προσπάθεια προβολής των θέσεων εργασίας χωρίς να είναι εγγεγραμμένος ο χρήστης.
	 Δεδομένου ότι ο υποψήφιος εργαζόμενος δεν έχει λογαριασμό στην υπηρεσία.
	 Όταν θα επισκέπτεται την κεντρική οθόνη της υπηρεσίας.
	 Τότε θα του εμφανίζεται μήνυμα σφάλματος το οποίο θα λέει "Παρακαλώ εγγραφείτε στην υπηρεσία για να έχετε πρόσβαση στις θέσεις εργασίας".
	 Και θα του εμφανιστεί ένα μήνυμα το οποίο θα λέει "για να εγγραφείτε στην υπηρεσία πατήστε εδώ".
 

