Feature: Νεα Θέση Εργασίας

    Scenario: Πρόσθεση μιας θέσης εργασίας
	    Με την προυπόθεση ότι είμαι διαχειριστής είτε φορέας απασχόλησης
		Όταν προσθέτω μια νέα δημοσίευση
		Και προσθέτω ότι πληροφορία απαιτείται
		Τότε θα πρέπει να μπορώ να προβάλω την νέα δημοσίευση
		
    Scenario: Η θέση εργασίας υπάρχει ήδη
	    Με την προυπόθεση ότι είμαι διαχειριστής είτε φορέας απασχόλησης
		Δεδομένου ότι η δημοσίευση υπάρχει ήδη
		Όταν προσπαθήσω να προσθέσω την ίδια δημοσίευση 
		Τότε πρέπει να βλέπω το μήνυμα "Η δημοσίευση ήδη υπάρχει"
