Feature: New WorkPosition

    Scenario: Πρόσθεση μιας θέσης εργασίας
	   Given ότι είμαι διαχειριστής είτε φορέας απασχόλησης
           When προσθέτω μια νέα δημοσίευση
	   And προσθέτω ότι πληροφορία απαιτείται
	   Then θα πρέπει να μπορώ να προβάλω την νέα δημοσίευση
		
    Scenario: Η θέση εργασίας υπάρχει ήδη
	   Given ότι είμαι διαχειριστής είτε φορέας απασχόλησης
           Given ότι η δημοσίευση υπάρχει ήδη
	   When προσπαθήσω να προσθέσω την ίδια δημοσίευση 
	   Then πρέπει να βλέπω το μήνυμα "Η δημοσίευση ήδη υπάρχει"
