Feature: PreferedJobs

				
   Scenario: Προσθήκη θέσης εργασίας που τον ενδιαφέρει
           Given ότι ο χρήστης έχει εγγραφεί στην  υπηρεσία.
	   When θα βρίσκει μία θέση εργασίας η οποία τον ενδιαφέρει θα μπορεί να αποθηκεύσει τις θέσεις εργασίας που τον ενδιαφέρουν περισσότερο.
	           |Όνομα_εργασίας|εργασίαID|
           Then θα μπορεί να δει το σύνολο των αποθηκευμένων θέσεων εργασίας. Και θα μπορεί να καταθέσει αίτηση απασχόλησης σε αυτές.
				
				
				
    Scenario: Προσθήκη θέσης εργασίας που τον ενδιαφέρει ενώ αυτή έχει καλυφθεί.
             When ο υποψήφιος εργαζόμενος θα βρίσκει μία θέση εργασίας η οποία έχει καλυφθεί, αλλά τον ενδιαφέρει περισσότερο από τις άλλες .
	      |Όνομα_εργασίας|εργασίαID|
             Then θα εμφανιστεί στην οθονη του μήνυμα σφάλματος στην οθονη το οποίο θα λέει "Λυπούμαστε αλλά η συγκεκριμένη θέση εργασίας έχει καλυφθεί"
             And θα τον προτρέπει να επιλέξει μία άλλη θέση εργασίας.
