Feature: Recovery Basket

	Scenario: Νέος Κάδος Ανάκτησης
	    Given ότι είμαι φορέας εργασίας είτε υποψηφίου εργασζομένου
	    When διαγράφω για πρώτη φορά μία δημοσίευση 
	    Then πρέπει να βλέπω τον κάδο Ανάκτησης
            And θα πρέπει να μπορώ να δω το περιεχόμενό του		
            And θα πρέπει να μπορώ να το ανακτήσω
		
	Scenario: Ενημέρωση Κάδου Ανάκτησης
	    Given ότι είμαι φορέας εργασίας είτε υποψηφίου εργαζομένου
	    Given ότι έχω δημοσιεύσεις στον κάδο Ανάκτησης
	    When προσθέτω καινούρια δημοσίευση 
            Then έχω την δυνατότητα να δω το ενημερωμένο περιεχόμενό του
		
	Scenario: Ανάκτηση Θέσης Εργασίας
	    Given να υπάρχουν δημοσιεύσεις στον κάδο Ανάκτησης
	    Then πρέπει να μπορώ να την ανακτήσω
	    And εμφανίζεται το μήνυμα "Η δημοσίευση ανακτίθηκε"
