Feature: Κάδος Ανάκτησης

	Scenario: Νέος Κάδος Ανάκτησης
	    Με την ιδιότητα του φορέα εργασίας είτε υποψηφίου εργασζομένου
		Όταν διαγράφω για πρώτη φορά μία δημοσίευση 
		Τότε πρέπει να βλέπω τον κάδο Ανάκτησης
        Και θα πρέπει να μπορώ να δω το περιεχόμενό του		
		Και θα πρέπει να μπορώ να το ανακτήσω
		
	Scenario: Ενημέρωση Κάδου Ανάκτησης
	    Με την ιδιότητα του φορέα εργασίας είτε υποψηφίου εργαζομένου
	   ΄Εχοντας δημοσιεύσεις στον κάδο Ανάκτησης
		Όταν προσθέτω καινούρια δημοσίευση 
		Τότε θα έχω την δυνατότητα να δω το ενημερωμένο περιεχόμενό του
		
	Scenario: Ανάκτηση Θέσης Εργασίας
	    Με την προυπόθεση να υπάρχουν δημοσιεύσεις στον κάδο Ανάκτησης
		Τότε πρέπει να μπορώ να την ανακτήσω
		Και να εμφανίζεται το μήνυμα "Η δημοσίευση ανακτίθηκε"
