Feature: Create Account

	Scenario: δημιουργία λογαριασμού                                                                                       
		Given θέλω να δημιουργήσω λογαριασμό με όνομα χρήστη και κωδικό πρόσβασης
		Then η εφαρμογή ρωτάει το είδος του λογαρισμού
		And έχω την επιλογή να διαλέξω τι είδους λογαριασμό θέλω 
		
	Scenario: Έλλειψη λογαριασμού
		Given ότι δεν έχω λογαριασμό για την εφαρμογή
		When θελήσω να χρησιμοποιήσω την υπηρεσία
		Then δεν θα μου επιτρέπεται η πρόσβαση
		
        Scenario: Περισσότεροι Λογαριασμοι
		Given ότι μπορώ να έχω περισσότερους από ένα λογαριασμούς
		When θα ετοιμάζομαι να εισάγω στοιχεία σύνδεσης
		Then θα πρέπει η εφαρμογή να ρωτάει ποιο λογαριασμό θελω να χρησιμοποιήσω 
