Feature: Δημιουργία λογαριασμού

	Scenario: δημιουργία λογαριασμού                                                                                       
		Όταν θέλω να δημιουργήσω λογαριασμό με όνομα χρήστη και κωδικό πρόσβασης
		Τότε η εφαρμογή ρωτάει το είδος του λογαρισμού
		Και έχω την επιλογή να διαλέξω τι είδους λογαριασμό θέλω 
		
	Scenario: Έλλειψη λογαριασμού
		Δεδομένου ότι δεν έχω λογαριασμό για την εφαρμογή
		Όταν θελήσω να χρησιμοποιήσω την υπηρεσία
		Τότε δεν θα μου επιτρέπεται η πρόσβαση
		
    Scenario: Περισσότεροι Λογαριασμοι
		Δεδομένου ότι μπορώ να έχω περισσότερους από ένα λογαριασμούς
		Όταν θα ετοιμάζομαι να εισάγω στοιχεία σύνδεσης
		Τότε θα πρέπει η εφαρμογή να ρωτάει ποιο λογαριασμό θελω να χρησιμοποιήσω 
