Feature: UserAuthentication

        Scenario: Δήλωση ενδιαφέροντος σε δημοσίευση
	        Given ενδιαφέρομαι για μια θέση
		When επιλέγω το "ενδιαφέρομαι"
		Then θα πρέπει να απαντήσω στην ερώτηση ασφαλείας
		
	Scenario: Αποστολή ηλεκτρονικών αρχείων
                When πατάω το κουμπί "Αποστολη" 		
		Then θα πρέπει να απαντήσω στην ερώτηση ασφαλείας
		And αν η απάντηση έιναι σωστή
		Then θα δω το μήνυμα "Επιτυχής Αποστολή"
		
	Scenario: Ταυτοποίηση σε είσοδο στο σύστημα
                When εισάγω τα στοιχεία εισόδου στην υπηρεσία 		
		Then θα πρέπει να απαντήσω και στην ερώτηση ασφαλείας
		And αν η απάντηση έιναι στην ερώτηση είναι σωστή
		Then θα έχω πρόσβαση στην υπηρεσία
		
	Scenario: Αποτυχία αποστολής ηλεκτρονικών αρχείων
               When πατάω το κουμπί "Αποστολη" 		
	       Then θα πρέπει να απαντήσω στην ερώτηση ασφαλείας
	       And αν η απάντηση έιναι λανθασμένη
	       Then θα δω το μήνυμα "Ανεπιτυχής Αποστολή"
	       And τα αρχεία δεν θα αποσταλλούν
		
	Scenario: Αποτυχία ταυτοποίησης σε είσοδο στο σύστημα
                When εισάγω τα στοιχεία εισόδου στην υπηρεσία 		
		Then θα πρέπει να απαντήσω και στην ερώτηση ασφαλείας
		And αν η απάντηση έιναι στην ερώτηση δεν είναι έγκυρη
		Then δεν θα έχω πρόσβαση στην υπηρεσία
