Feature: Ταυτοποίηση Χρήστη

    Scenario: Δήλωση ενδιαφέροντος σε δημοσίευση
	    Στην περίπτωση που ενδιαφέρομαι για μια θέση
		Όταν επιλέγω το "ενδιαφέρομαι"
		Τότε θα πρέπει να απαντήσω στην ερώτηση ασφαλείας
		
	Scenario: Αποστολή ηλεκτρονικών αρχείων
        Όταν πατάω το κουμπί "Αποστολη" 		
		Τότε θα πρέπει να απαντήσω στην ερώτηση ασφαλείας
		Και αν η απάντηση έιναι σωστή
		Τότε θα δω το μήνυμα "Επιτυχής Αποστολή"
		
	Scenario: Ταυτοποίηση σε είσοδο στο σύστημα
        Όταν εισάγω τα στοιχεία εισόδου στην υπηρεσία 		
		Τότε θα πρέπει να απαντήσω και στην ερώτηση ασφαλείας
		Και αν η απάντηση έιναι στην ερώτηση είναι σωστή
		Τότε θα έχω πρόσβαση στην υπηρεσία
		
	Scenario:Αποτυχία αποστολής ηλεκτρονικών αρχείων
        Όταν πατάω το κουμπί "Αποστολη" 		
		Τότε θα πρέπει να απαντήσω στην ερώτηση ασφαλείας
		Και αν η απάντηση έιναι λανθασμένη
		Τότε θα δω το μήνυμα "Ανεπιτυχής Αποστολή"
		Και τα αρχεία δεν θα αποσταλλούν
		
	Scenario:Αποτυχία ταυτοποίησης σε είσοδο στο σύστημα
        Όταν εισάγω τα στοιχεία εισόδου στην υπηρεσία 		
		Τότε θα πρέπει να απαντήσω και στην ερώτηση ασφαλείας
		Και αν η απάντηση έιναι στην ερώτηση δεν είναι έγκυρη
		Τότε δεν θα έχω πρόσβαση στην υπηρεσία
