Feature: Περιοχή θέσης Εργασίας

	Scenario: Προβολή περιοχής θέσης Εργασίας
		Δηλώνοντας ενδιαφέρον σε μια θέση εργασίας
		Όταν επιλέγω να προβάλω περισότερες πληροφορίες για την θέση εργασίας
		Τότε θα μπορώ να δω ένα ηλεκτρονικό χάρτη με τη γεωγραφική θέση της περιοχής
		

	Scenario: Διόρθωση περιοχής θέσης εργασίας
		Βλέποντας ότι η γεωγραφική περιοχή της θέσης απασχόλησης στο χάρτη έχει δηλωθεί λάθος στο χάρτη
		Έχοντας δικαιώματα διαχειριστή 
		Τότε πρέπει να μπορώ να αλλάζω τη θέση στο χάρτη με τη σωστή
		Και θα έχω το μήνυμα "Η γεωγραφική θέση ενημερώθηκε"
