Feature: WorkPositionArea

	Scenario: Προβολή περιοχής θέσης Εργασίας
		Given ότι έχω δηλώσει ενδιαφέρον σε μια θέση εργασίας
		When επιλέγω να προβάλω περισότερες πληροφορίες για την θέση εργασίας
		Then θα μπορώ να δω ένα ηλεκτρονικό χάρτη με τη γεωγραφική θέση της περιοχής
		

	Scenario: Διόρθωση περιοχής θέσης εργασίας
		Given ότι η γεωγραφική περιοχή της θέσης απασχόλησης στο χάρτη έχει δηλωθεί λάθος στο χάρτη
		When έχω δικαιώματα διαχειριστή 
		Then πρέπει να μπορώ να αλλάζω τη θέση στο χάρτη με τη σωστή
		And θα έχω το μήνυμα "Η γεωγραφική θέση ενημερώθηκε"
